reporte_html/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 49,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.8775510204081636,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 8.0,
    "throughput" : 30.4726368159204,
    "receivedKBytesPerSec" : 5.802894706156716,
    "sentKBytesPerSec" : 6.933715212997512
  },
  "Actualizar peso" : {
    "transaction" : "Actualizar peso",
    "sampleCount" : 49,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.8775510204081636,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 8.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 8.0,
    "throughput" : 30.4726368159204,
    "receivedKBytesPerSec" : 5.802894706156716,
    "sentKBytesPerSec" : 6.933715212997512
  }
}